MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0L1303/mcu.h
/* IOMUX_PINCM7[PF] Bits */
#define IOMUX_PINCM7_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM7_PF_GPIOA_DIO06                   ((uint32_t)0X00000001)
#define IOMUX_PINCM7_PF_TIMG0_CCP1                    ((uint32_t)0X00000002)
#define IOMUX_PINCM7_PF_SPI0_SCLK                     ((uint32_t)0X00000003)

/* IOMUX_PINCM8[PF] Bits */
#define IOMUX_PINCM8_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM8_PF_GPIOA_DIO07                   ((uint32_t)0X00000001)
#define IOMUX_PINCM8_PF_COMP0_OUT                     ((uint32_t)0X00000002)
#define IOMUX_PINCM8_PF_SYSCTL_CLK_OUT                ((uint32_t)0X00000003)
#define IOMUX_PINCM8_PF_TIMG1_CCP0                    ((uint32_t)0X00000004)

/* IOMUX_PINCM9[PF] Bits */
#define IOMUX_PINCM9_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM9_PF_GPIOA_DIO08                   ((uint32_t)0X00000001)
#define IOMUX_PINCM9_PF_UART0_TX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM9_PF_SPI0_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM9_PF_UART1_RTS                     ((uint32_t)0X00000004)
#define IOMUX_PINCM9_PF_TIMG2_CCP0                    ((uint32_t)0X00000005)

/* IOMUX_PINCM10[PF] Bits */
#define IOMUX_PINCM10_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM10_PF_GPIOA_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM10_PF_UART0_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM10_PF_SPI0_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM10_PF_UART1_CTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM10_PF_TIMG2_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM10_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)

/* IOMUX_PINCM11[PF] Bits */
#define IOMUX_PINCM11_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM11_PF_GPIOA_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM11_PF_UART1_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM11_PF_SPI0_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM11_PF_I2C0_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM11_PF_TIMG4_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM11_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)

/* IOMUX_PINCM12[PF] Bits */
#define IOMUX_PINCM12_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM12_PF_GPIOA_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM12_PF_UART1_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM12_PF_SPI0_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM12_PF_I2C0_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM12_PF_TIMG4_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM12_PF_COMP0_OUT                    ((uint32_t)0X00000006)

/* IOMUX_PINCM13[PF] Bits */
#define IOMUX_PINCM13_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM13_PF_GPIOA_DIO12                  ((uint32_t)0X00000001)
#define IOMUX_PINCM13_PF_UART0_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM13_PF_TIMG0_CCP0                   ((uint32_t)0X00000003)
#define IOMUX_PINCM13_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000004)

/* IOMUX_PINCM14[PF] Bits */
#define IOMUX_PINCM14_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM14_PF_GPIOA_DIO13                  ((uint32_t)0X00000001)
#define IOMUX_PINCM14_PF_UART0_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM14_PF_TIMG0_CCP1                   ((uint32_t)0X00000003)
#define IOMUX_PINCM14_PF_UART1_RX                     ((uint32_t)0X00000004)

/* IOMUX_PINCM15[PF] Bits */
#define IOMUX_PINCM15_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM15_PF_GPIOA_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM15_PF_UART1_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM15_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000003)
#define IOMUX_PINCM15_PF_UART1_TX                     ((uint32_t)0X00000004)
#define IOMUX_PINCM15_PF_TIMG1_CCP0                   ((uint32_t)0X00000005)

/* IOMUX_PINCM16[PF] Bits */
#define IOMUX_PINCM16_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM16_PF_GPIOA_DIO15                  ((uint32_t)0X00000001)
#define IOMUX_PINCM16_PF_UART1_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM16_PF_I2C1_SCL                     ((uint32_t)0X00000003)
#define IOMUX_PINCM16_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000004)
#define IOMUX_PINCM16_PF_TIMG4_CCP1                   ((uint32_t)0X00000005)

/* IOMUX_PINCM17[PF] Bits */
#define IOMUX_PINCM17_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM17_PF_GPIOA_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM17_PF_COMP0_OUT                    ((uint32_t)0X00000002)
#define IOMUX_PINCM17_PF_I2C1_SDA                     ((uint32_t)0X00000003)
#define IOMUX_PINCM17_PF_SPI0_POCI                    ((uint32_t)0X00000004)
#define IOMUX_PINCM17_PF_TIMG0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM17_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000006)

/* IOMUX_PINCM18[PF] Bits */
#define IOMUX_PINCM18_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM18_PF_GPIOA_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM18_PF_UART0_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM18_PF_I2C1_SCL                     ((uint32_t)0X00000003)
#define IOMUX_PINCM18_PF_SPI0_SCLK                    ((uint32_t)0X00000004)
#define IOMUX_PINCM18_PF_TIMG4_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM18_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000006)

/* IOMUX_PINCM19[PF] Bits */
#define IOMUX_PINCM19_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM19_PF_GPIOA_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM19_PF_UART0_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM19_PF_SPI0_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM19_PF_I2C1_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM19_PF_TIMG4_CCP1                   ((uint32_t)0X00000005)

/* IOMUX_PINCM20[PF] Bits */
#define IOMUX_PINCM20_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM20_PF_GPIOA_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM20_PF_DEBUGSS_SWDIO                ((uint32_t)0X00000002)
#define IOMUX_PINCM20_PF_I2C1_SDA                     ((uint32_t)0X00000003)
#define IOMUX_PINCM20_PF_SPI0_POCI                    ((uint32_t)0X00000004)

